IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_OUTPUTXBAR_CONTROLSS_OUTPUTXBAR.xml
<module name="CONTROLSS_OUTPUTXBAR_CONTROLSS_OUTPUTXBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_OUTPUTXBAR_PID" acronym="CONTROLSS_OUTPUTXBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_STATUS" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_STATUS" offset="0x10" width="16" description="">
		<bitfield id="STS" width="16" begin="15" end="0" resetval="0x0" description="Status" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAGINVERT" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAGINVERT" offset="0x14" width="16" description="">
		<bitfield id="INVERT" width="16" begin="15" end="0" resetval="0x0" description="FlagInvert" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAG" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAG" offset="0x18" width="16" description="">
		<bitfield id="BIT15" width="1" begin="15" end="15" resetval="0x0" description="output xbar flag" range="15" rwaccess="RW"/> 
		<bitfield id="BIT14" width="1" begin="14" end="14" resetval="0x0" description="output xbar flag" range="14" rwaccess="RW"/> 
		<bitfield id="BIT13" width="1" begin="13" end="13" resetval="0x0" description="output xbar flag" range="13" rwaccess="RW"/> 
		<bitfield id="BIT12" width="1" begin="12" end="12" resetval="0x0" description="output xbar flag" range="12" rwaccess="RW"/> 
		<bitfield id="BIT11" width="1" begin="11" end="11" resetval="0x0" description="output xbar flag" range="11" rwaccess="RW"/> 
		<bitfield id="BIT10" width="1" begin="10" end="10" resetval="0x0" description="output xbar flag" range="10" rwaccess="RW"/> 
		<bitfield id="BIT9" width="1" begin="9" end="9" resetval="0x0" description="output xbar flag" range="9" rwaccess="RW"/> 
		<bitfield id="BIT8" width="1" begin="8" end="8" resetval="0x0" description="output xbar flag" range="8" rwaccess="RW"/> 
		<bitfield id="BIT7" width="1" begin="7" end="7" resetval="0x0" description="output xbar flag" range="7" rwaccess="RW"/> 
		<bitfield id="BIT6" width="1" begin="6" end="6" resetval="0x0" description="output xbar flag" range="6" rwaccess="RW"/> 
		<bitfield id="BIT5" width="1" begin="5" end="5" resetval="0x0" description="output xbar flag" range="5" rwaccess="RW"/> 
		<bitfield id="BIT4" width="1" begin="4" end="4" resetval="0x0" description="output xbar flag" range="4" rwaccess="RW"/> 
		<bitfield id="BIT3" width="1" begin="3" end="3" resetval="0x0" description="output xbar flag" range="3" rwaccess="RW"/> 
		<bitfield id="BIT2" width="1" begin="2" end="2" resetval="0x0" description="output xbar flag" range="2" rwaccess="RW"/> 
		<bitfield id="BIT1" width="1" begin="1" end="1" resetval="0x0" description="output xbar flag" range="1" rwaccess="RW"/> 
		<bitfield id="BIT0" width="1" begin="0" end="0" resetval="0x0" description="output xbar flag" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAG_CLR" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAG_CLR" offset="0x1C" width="16" description="">
		<bitfield id="BIT15" width="1" begin="15" end="15" resetval="0x0" description="output xbar flag clear" range="15" rwaccess="RW"/> 
		<bitfield id="BIT14" width="1" begin="14" end="14" resetval="0x0" description="output xbar flag clear" range="14" rwaccess="RW"/> 
		<bitfield id="BIT13" width="1" begin="13" end="13" resetval="0x0" description="output xbar flag clear" range="13" rwaccess="RW"/> 
		<bitfield id="BIT12" width="1" begin="12" end="12" resetval="0x0" description="output xbar flag clear" range="12" rwaccess="RW"/> 
		<bitfield id="BIT11" width="1" begin="11" end="11" resetval="0x0" description="output xbar flag clear" range="11" rwaccess="RW"/> 
		<bitfield id="BIT10" width="1" begin="10" end="10" resetval="0x0" description="output xbar flag clear" range="10" rwaccess="RW"/> 
		<bitfield id="BIT9" width="1" begin="9" end="9" resetval="0x0" description="output xbar flag clear" range="9" rwaccess="RW"/> 
		<bitfield id="BIT8" width="1" begin="8" end="8" resetval="0x0" description="output xbar flag clear" range="8" rwaccess="RW"/> 
		<bitfield id="BIT7" width="1" begin="7" end="7" resetval="0x0" description="output xbar flag clear" range="7" rwaccess="RW"/> 
		<bitfield id="BIT6" width="1" begin="6" end="6" resetval="0x0" description="output xbar flag clear" range="6" rwaccess="RW"/> 
		<bitfield id="BIT5" width="1" begin="5" end="5" resetval="0x0" description="output xbar flag clear" range="5" rwaccess="RW"/> 
		<bitfield id="BIT4" width="1" begin="4" end="4" resetval="0x0" description="output xbar flag clear" range="4" rwaccess="RW"/> 
		<bitfield id="BIT3" width="1" begin="3" end="3" resetval="0x0" description="output xbar flag clear" range="3" rwaccess="RW"/> 
		<bitfield id="BIT2" width="1" begin="2" end="2" resetval="0x0" description="output xbar flag clear" range="2" rwaccess="RW"/> 
		<bitfield id="BIT1" width="1" begin="1" end="1" resetval="0x0" description="output xbar flag clear" range="1" rwaccess="RW"/> 
		<bitfield id="BIT0" width="1" begin="0" end="0" resetval="0x0" description="output xbar flag clear" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAGFORCE" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR_FLAGFORCE" offset="0x20" width="16" description="">
		<bitfield id="FRC" width="16" begin="15" end="0" resetval="0x0" description="FlagForce" range="15 - 0" rwaccess="RW"/>
	</register>
