IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_OUTPUTXBAR_CONTROLSS_OUTPUTXBAR.xml
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G2" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G2" offset="0x248" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBar5 G2 input bit select. Input source is PWM[x].SOCB1: PWM[x] SOCB selected0: PWM[x] SOCB is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G3" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G3" offset="0x24C" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBar5 G3 input bit select. Input source is DEL[x].ACTIVE1: DEL[x] ACTIVE selected0: DEL[x] ACTIVE is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G4" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G4" offset="0x250" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBar5 G4 input bit select. Input source is DEL[x].TRIP1: DEL[x] TRIP selected0: DEL[x] TRIP is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G5" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G5" offset="0x254" width="24" description="">
		<bitfield id="SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBar5 G5 input bit select.0: SDFM0.FILT1CEVT11: SDFM0.FILT1CEVT22: SDFM0.FILT1COMPHZ3: SDFM0.FILT2CEVT14: SDFM0.FILT2CEVT25: SDFM0.FILT2COMPHZ6: SDFM0.FILT3CEVT17: SDFM0.FILT3CEVT28: SDFM0.FILT3COMPHZ9: SDFM0.FILT4CEVT110: SDFM0.FILT4CEVT211: SDFM0.FILT4COMPHZ12: SDFM1.FILT1CEVT113: SDFM1.FILT1CEVT214: SDFM1.FILT1COMPHZ15: SDFM1.FILT2CEVT116: SDFM1.FILT2CEVT217: SDFM1.FILT2COMPHZ18: SDFM1.FILT3CEVT119: SDFM1.FILT3CEVT220: SDFM1.FILT3COMPHZ21: SDFM1.FILT4CEVT122: SDFM1.FILT4CEVT223: SDFM1.FILT4COMPHZ" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G6" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G6" offset="0x258" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBar5 G6 Input Select0: CMP12SS0.CTRIPOUTL1: CMP12SS0.CTRIPOUTH2: CMP12SS1.CTRIPOUTL3: CMP12SS1.CTRIPOUTH4: CMP12SS2.CTRIPOUTL5: CMP12SS2.CTRIPOUTH6: CMP12SS3.CTRIPOUTL7: CMP12SS3.CTRIPOUTH8: CMP12SS4.CTRIPOUTL9: CMP12SS4.CTRIPOUTH10: CMP12SS5.CTRIPOUTL11: CMP12SS5.CTRIPOUTH12: CMP12SS6.CTRIPOUTL13: CMP12SS6.CTRIPOUTH14: CMP12SS7.CTRIPOUTL15: CMP12SS7.CTRIPOUTH16: CMP12SS8.CTRIPOUTL17: CMP12SS8.CTRIPOUTH18: CMP12SS9.CTRIPOUTL19: CMP12SS9.CTRIPOUTH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G7" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G7" offset="0x25C" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="G7: OUTPUT XBar5 G7 Input Select0: CMP8SS0.CTRIPOUTL1: CMP8SS0.CTRIPOUTH2: CMP8SS1.CTRIPOUTL3: CMP8SS1.CTRIPOUTH4: CMP8SS2.CTRIPOUTL5: CMP8SS2.CTRIPOUTH6: CMP8SS3.CTRIPOUTL7: CMP8SS3.CTRIPOUTH8: CMP8SS4.CTRIPOUTL9: CMP8SS4.CTRIPOUTH10: CMP8SS5.CTRIPOUTL11: CMP8SS5.CTRIPOUTH12: CMP8SS6.CTRIPOUTL13: CMP8SS6.CTRIPOUTH14: CMP8SS7.CTRIPOUTL15: CMP8SS7.CTRIPOUTH16: CMP8SS8.CTRIPOUTL17: CMP8SS8.CTRIPOUTH18: CMP8SS9.CTRIPOUTL19: CMP8SS9.CTRIPOUTH" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G8" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G8" offset="0x260" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="G8: OUTPUT XBar5 G8 Input Select0: ADC0.EVT11: ADC0.EVT22: ADC0.EVT33: ADC0.EVT44: ADC1.EVT15: ADC1.EVT26: ADC1.EVT37: ADC1 EVT48: ADC2.EVT19: ADC2 EVT210: ADC2.EVT311: ADC2.EVT412: ADC3.EVT113: ADC3.EVT214: ADC3.EVT315: ADC3.EVT416: ADC4.EVT117: ADC4.EVT218: ADC4.EVT319: ADC4.EVT4" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G9" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G9" offset="0x264" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="G9: OUTPUT XBar5 G9 Input Select0: PWMSyncOutXBar.SYNCOUT01: PWMSyncOutXBar.SYNCOUT12: PWMSyncOutXBar.SYNCOUT23: PWMSyncOutXBar.SYNCOUT34: EQEP0.I_OUT5: EQEP0.S_OUT6: EQEP1.I_OUT7: EQEP1.S_OUT8: EQEP2.I_OUT9: EQEP2.S_OUT10: ECAP0.OUT11: ECAP1.OUT12: ECAP2.OUT13: ECAP3.OUT14: ECAP4.OUT15: ECAP5.OUT16: ECAP6.OUT17: ECAP7.OUT18: ECAP8.OUT19: ECAP9.OUT" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G10" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR5_G10" offset="0x268" width="16" description="">
		<bitfield id="SEL" width="16" begin="15" end="0" resetval="0x0" description="G10: OUTPUT XBar5 G10 Input Select3:0: FSIRX0.RX_TRIG07:4: FSIRX1.RX_TRIG011:8: FSIRX2.RX_TRIG015:12: FSIRX3.RX_TRIG0" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G0" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G0" offset="0x280" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G0: PWM XBar6 G0 input bit select. Input source is PWM[x].TRIPOUT1: PWM[x] TRIPOUT selected0: PWM[x] TRIPOUT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G1" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G1" offset="0x284" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G1: OUTPUT XBar6 G1 input bit select. Input source is PWM[x].SOCA1: PWM[x] SOCA selected0: PWM[x] SOCA is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G2" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G2" offset="0x288" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G2: OUTPUT XBar6 G2 input bit select. Input source is PWM[x].SOCB1: PWM[x] SOCB selected0: PWM[x] SOCB is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G3" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G3" offset="0x28C" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G3: OUTPUT XBar6 G3 input bit select. Input source is DEL[x].ACTIVE1: DEL[x] ACTIVE selected0: DEL[x] ACTIVE is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G4" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G4" offset="0x290" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="G4: OUTPUT XBar6 G4 input bit select. Input source is DEL[x].TRIP1: DEL[x] TRIP selected0: DEL[x] TRIP is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G5" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G5" offset="0x294" width="24" description="">
		<bitfield id="SEL" width="24" begin="23" end="0" resetval="0x0" description="G5: OUTPUT XBar6 G5 input bit select.0: SDFM0.FILT1CEVT11: SDFM0.FILT1CEVT22: SDFM0.FILT1COMPHZ3: SDFM0.FILT2CEVT14: SDFM0.FILT2CEVT25: SDFM0.FILT2COMPHZ6: SDFM0.FILT3CEVT17: SDFM0.FILT3CEVT28: SDFM0.FILT3COMPHZ9: SDFM0.FILT4CEVT110: SDFM0.FILT4CEVT211: SDFM0.FILT4COMPHZ12: SDFM1.FILT1CEVT113: SDFM1.FILT1CEVT214: SDFM1.FILT1COMPHZ15: SDFM1.FILT2CEVT116: SDFM1.FILT2CEVT217: SDFM1.FILT2COMPHZ18: SDFM1.FILT3CEVT119: SDFM1.FILT3CEVT220: SDFM1.FILT3COMPHZ21: SDFM1.FILT4CEVT122: SDFM1.FILT4CEVT223: SDFM1.FILT4COMPHZ" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G6" acronym="CONTROLSS_OUTPUTXBAR_OUTPUTXBAR6_G6" offset="0x298" width="24" description="">
		<bitfield id="SEL" width="20" begin="19" end="0" resetval="0x0" description="G6: OUTPUT XBar6 G6 Input Select0: CMP12SS0.CTRIPOUTL1: CMP12SS0.CTRIPOUTH2: CMP12SS1.CTRIPOUTL3: CMP12SS1.CTRIPOUTH4: CMP12SS2.CTRIPOUTL5: CMP12SS2.CTRIPOUTH6: CMP12SS3.CTRIPOUTL7: CMP12SS3.CTRIPOUTH8: CMP12SS4.CTRIPOUTL9: CMP12SS4.CTRIPOUTH10: CMP12SS5.CTRIPOUTL11: CMP12SS5.CTRIPOUTH12: CMP12SS6.CTRIPOUTL13: CMP12SS6.CTRIPOUTH14: CMP12SS7.CTRIPOUTL15: CMP12SS7.CTRIPOUTH16: CMP12SS8.CTRIPOUTL17: CMP12SS8.CTRIPOUTH18: CMP12SS9.CTRIPOUTL19: CMP12SS9.CTRIPOUTH" range="19 - 0" rwaccess="RW"/>
	</register>
